In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
from sqlalchemy.sql import text

/tmp/ipykernel_1124/428842187.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

### Create schema and test

In [2]:
# run ```docker-compose --profile hw_dbs up``` to raise the db
engine = create_engine('postgresql://postgres:admin@master_ds_dbs_postgre:5432/hw3')
if not database_exists(engine.url):
    create_database(engine.url)

database_exists(engine.url)

True

In [3]:
tables = {
    "customer": """CREATE TABLE customer (
      customer_id serial primary key,
      first_name varchar(32) not null,
      last_name varchar(32),
      gender varchar(6) not null,
      dob date,
      job_title varchar(64),
      job_industry_category varchar(64),
      wealth_segment varchar(32) not null,
      deceased_indicator char(1) not null,
      owns_car boolean not null,
      address text not null,
      postcode char(4) not null,
      state varchar(32) not null,
      country varchar(32) not null,
      property_valuation int not null
    )
    """,

    "transaction": """CREATE TABLE transaction (
      transaction_id serial primary key,
      customer_id serial,
      product_id serial not null,
      transaction_date date,
      online_order bool,
      order_status varchar(16),
      brand varchar(32),
      product_line varchar(16),
      product_class varchar(16),
      product_size varchar(16),
      list_price numeric,
      standard_cost numeric
    )
    """
}
with engine.connect() as con:
    for table, create in tables.items():
        con.execute(text(f"DROP TABLE IF EXISTS {table} CASCADE"))
        con.execute(text(create))
    con.commit()

In [4]:
%load_ext sql

In [5]:
customer = pd.read_csv('./datasets/customer.csv', sep=';')
transaction = pd.read_csv('./datasets/transaction.csv', sep=';')
customer.rename(columns={'DOB': 'dob'}, inplace=True)

customer.head(2)

,customer_id,first_name,last_name,gender,dob,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,Eli,Bockman,Male,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,6 Meadow Vale Court,2153,New South Wales,Australia,10

In [6]:
transaction.head(2)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost
0,1,2,2950,25.02.2017,False,Approved,Solex,Standard,medium,medium,"71,49","53,62"
1,2,3,3120,21.05.2017,True,Approved,Trek Bicycles,Standard,medium,large,"2091,47","388,92"

In [7]:
transaction['transaction_date'] = pd.to_datetime(transaction['transaction_date'])
transaction['list_price'] = pd.to_numeric(transaction['list_price'].str.replace(',', '.'))
transaction['standard_cost'] = pd.to_numeric(transaction['standard_cost'].str.replace(',', '.'))

/tmp/ipykernel_1124/4011403136.py:1: UserWarning: Parsing dates in %d.%m.%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  transaction['transaction_date'] = pd.to_datetime(transaction['transaction_date'])

In [8]:
customer.to_sql('customer', con=engine, index=False, if_exists='append')
transaction.to_sql('transaction', con=engine, index=False, if_exists='append', )

1000

In [9]:
%sql postgresql://postgres:admin@master_ds_dbs_postgre:5432/hw3

In [10]:
%%sql
SELECT * FROM customer LIMIT 10;

 * postgresql://postgres:***@master_ds_dbs_postgre:5432/hw3
10 rows affected.

[(1, 'Laraine', 'Medendorp', 'F', datetime.date(1953, 10, 12), 'Executive Secretary', 'Health', 'Mass Customer', 'N', True, '060 Morning Avenue', '2016', 'New South Wales', 'Australia', 10),
 (2, 'Eli', 'Bockman', 'Male', datetime.date(1980, 12, 16), 'Administrative Officer', 'Financial Services', 'Mass Customer', 'N', True, '6 Meadow Vale Court', '2153', 'New South Wales', 'Australia', 10),
 (3, 'Arlin', 'Dearle', 'Male', datetime.date(1954, 1, 20), 'Recruiting Manager', 'Property', 'Mass Customer', 'N', True, '0 Holy Cross Court', '4211', 'QLD', 'Australia', 9),
 (4, 'Talbot', None, 'Male', datetime.date(1961, 10, 3), None, 'IT', 'Mass Customer', 'N', False, '17979 Del Mar Point', '2448', 'New South Wales', 'Australia', 4),
 (5, 'Sheila-kathryn', 'Calton', 'Female', datetime.date(1977, 5, 13), 'Senior Editor', None, 'Affluent Customer', 'N', True, '9 Oakridge Court', '3216', 'VIC', 'Australia', 9),
 (6, 'Curr', 'Duckhouse', 'Male', datetime.date(1966, 9, 16), None, 'Retail', 'High Net Worth', 'N', True, '4 Delaware Trail', '2210', 'New South Wales', 'Australia', 9),
 (7, 'Fina', 'Merali', 'Female', datetime.date(1976, 2, 23), None, 'Financial Services', 'Affluent Customer', 'N', True, '49 Londonderry Lane', '2650', 'New South Wales', 'Australia', 4),
 (8, 'Rod', 'Inder', 'Male', datetime.date(1962, 3, 30), 'Media Manager I', None, 'Mass Customer', 'N', False, '97736 7th Trail', '2023', 'New South Wales', 'Australia', 12),
 (9, 'Mala', 'Lind', 'Female', datetime.date(1973, 3, 10), 'Business Systems Development Analyst', 'Argiculture', 'Affluent Customer', 'N', True, '93405 Ludington Park', '3044', 'VIC', 'Australia', 8),
 (10, 'Fiorenze', 'Birdall', 'Female', datetime.date(1988, 10, 11), 'Senior Quality Engineer', 'Financial Services', 'Mass Customer', 'N', True, '44339 Golden Leaf Alley', '4557', 'QLD', 'Australia', 4)]

In [11]:
%%sql
SELECT * FROM transaction LIMIT 10;

 * postgresql://postgres:***@master_ds_dbs_postgre:5432/hw3
10 rows affected.

[(1, 2950, 2, datetime.date(2017, 2, 25), False, 'Approved', 'Solex', 'Standard', 'medium', 'medium', Decimal('71.49'), Decimal('53.62')),
 (2, 3120, 3, datetime.date(2017, 5, 21), True, 'Approved', 'Trek Bicycles', 'Standard', 'medium', 'large', Decimal('2091.47'), Decimal('388.92')),
 (3, 402, 37, datetime.date(2017, 10, 16), False, 'Approved', 'OHM Cycles', 'Standard', 'low', 'medium', Decimal('1793.43'), Decimal('248.82')),
 (4, 3135, 88, datetime.date(2017, 8, 31), False, 'Approved', 'Norco Bicycles', 'Standard', 'medium', 'medium', Decimal('1198.46'), Decimal('381.1')),
 (5, 787, 78, datetime.date(2017, 10, 1), True, 'Approved', 'Giant Bicycles', 'Standard', 'medium', 'large', Decimal('1765.3'), Decimal('709.48')),
 (6, 2339, 25, datetime.date(2017, 3, 8), True, 'Approved', 'Giant Bicycles', 'Road', 'medium', 'medium', Decimal('1538.99'), Decimal('829.65')),
 (7, 1542, 22, datetime.date(2017, 4, 21), True, 'Approved', 'WeareA2B', 'Standard', 'medium', 'medium', Decimal('60.34'), Decimal('45.26')),
 (8, 2459, 15, datetime.date(2017, 7, 15), False, 'Approved', 'WeareA2B', 'Standard', 'medium', 'medium', Decimal('1292.84'), Decimal('13.44')),
 (9, 1305, 67, datetime.date(2017, 8, 10), False, 'Approved', 'Solex', 'Standard', 'medium', 'large', Decimal('1071.23'), Decimal('380.74')),
 (10, 3262, 12, datetime.date(2017, 8, 30), True, 'Approved', 'WeareA2B', 'Standard', 'medium', 'medium', Decimal('1231.15'), Decimal('161.6'))]

### Tasks

#### Task 1

Вывести распределение (количество) клиентов по сферам деятельности, отсортировав результат по убыванию количества. — (1 балл)

In [56]:
%%sql

SELECT job_industry_category, COUNT(*) as customer_count
FROM customer
GROUP BY job_industry_category
ORDER BY customer_count DESC;

 * postgresql://postgres:***@master_ds_dbs_postgre:5432/hw3
10 rows affected.

[('Manufacturing', 799),
 ('Financial Services', 774),
 (None, 656),
 ('Health', 602),
 ('Retail', 358),
 ('Property', 267),
 ('IT', 223),
 ('Entertainment', 136),
 ('Argiculture', 113),
 ('Telecommunications', 72)]

#### Task 2

Найти сумму транзакций за каждый месяц по сферам деятельности, отсортировав по месяцам и по сфере деятельности. — (1 балл)

In [58]:
%%sql

SELECT to_char(t.transaction_date, 'MM-YYYY') as transaction_month, c.job_industry_category, SUM(t.list_price)
FROM transaction t
LEFT JOIN customer c ON t.customer_id = c.customer_id
GROUP BY transaction_month, c.job_industry_category
ORDER BY transaction_month, c.job_industry_category;

 * postgresql://postgres:***@master_ds_dbs_postgre:5432/hw3
120 rows affected.

[('01-2017', 'Argiculture', Decimal('43513.82')),
 ('01-2017', 'Entertainment', Decimal('64089.92')),
 ('01-2017', 'Financial Services', Decimal('366383.71')),
 ('01-2017', 'Health', Decimal('286860.38')),
 ('01-2017', 'IT', Decimal('107783.37')),
 ('01-2017', 'Manufacturing', Decimal('365232.45')),
 ('01-2017', 'Property', Decimal('100686.97')),
 ('01-2017', 'Retail', Decimal('182375.75')),
 ('01-2017', 'Telecommunications', Decimal('31210.20')),
 ('01-2017', None, Decimal('317922.69')),
 ('02-2017', 'Argiculture', Decimal('60016.81')),
 ('02-2017', 'Entertainment', Decimal('63965.98')),
 ('02-2017', 'Financial Services', Decimal('375961.86')),
 ('02-2017', 'Health', Decimal('268525.79')),
 ('02-2017', 'IT', Decimal('93961.77')),
 ('02-2017', 'Manufacturing', Decimal('389260.51')),
 ('02-2017', 'Property', Decimal('112255.39')),
 ('02-2017', 'Retail', Decimal('146107.62')),
 ('02-2017', 'Telecommunications', Decimal('27678.20')),
 ('02-2017', None, Decimal('260711.90')),
 ('03-2017', 'Argiculture', Decimal('49048.49')),
 ('03-2017', 'Entertainment', Decimal('77122.43')),
 ('03-2017', 'Financial Services', Decimal('322268.48')),
 ('03-2017', 'Health', Decimal('290575.82')),
 ('03-2017', 'IT', Decimal('100212.38')),
 ('03-2017', 'Manufacturing', Decimal('377784.59')),
 ('03-2017', 'Property', Decimal('125143.58')),
 ('03-2017', 'Retail', Decimal('172366.56')),
 ('03-2017', 'Telecommunications', Decimal('24541.28')),
 ('03-2017', None, Decimal('278553.89')),
 ('04-2017', 'Argiculture', Decimal('45978.31')),
 ('04-2017', 'Entertainment', Decimal('70263.62')),
 ('04-2017', 'Financial Services', Decimal('348074.26')),
 ('04-2017', 'Health', Decimal('285820.80')),
 ('04-2017', 'IT', Decimal('112883.44')),
 ('04-2017', 'Manufacturing', Decimal('384590.71')),
 ('04-2017', 'Property', Decimal('111973.92')),
 ('04-2017', 'Retail', Decimal('185587.70')),
 ('04-2017', 'Telecommunications', Decimal('35125.32')),
 ('04-2017', None, Decimal('262711.10')),
 ('05-2017', 'Argiculture', Decimal('74518.68')),
 ('05-2017', 'Entertainment', Decimal('73800.48')),
 ('05-2017', 'Financial Services', Decimal('375253.64')),
 ('05-2017', 'Health', Decimal('292596.47')),
 ('05-2017', 'IT', Decimal('100426.56')),
 ('05-2017', 'Manufacturing', Decimal('367089.37')),
 ('05-2017', 'Property', Decimal('135044.44')),
 ('05-2017', 'Retail', Decimal('148247.71')),
 ('05-2017', 'Telecommunications', Decimal('27124.35')),
 ('05-2017', None, Decimal('314621.34')),
 ('06-2017', 'Argiculture', Decimal('52940.08')),
 ('06-2017', 'Entertainment', Decimal('65918.61')),
 ('06-2017', 'Financial Services', Decimal('376155.26')),
 ('06-2017', 'Health', Decimal('219846.92')),
 ('06-2017', 'IT', Decimal('98267.76')),
 ('06-2017', 'Manufacturing', Decimal('338854.23')),
 ('06-2017', 'Property', Decimal('117475.87')),
 ('06-2017', 'Retail', Decimal('162107.46')),
 ('06-2017', 'Telecommunications', Decimal('35107.85')),
 ('06-2017', None, Decimal('288726.27')),
 ('07-2017', 'Argiculture', Decimal('49134.42')),
 ('07-2017', 'Entertainment', Decimal('57405.14')),
 ('07-2017', 'Financial Services', Decimal('358209.37')),
 ('07-2017', 'Health', Decimal('315828.26')),
 ('07-2017', 'IT', Decimal('97527.38')),
 ('07-2017', 'Manufacturing', Decimal('372981.44')),
 ('07-2017', 'Property', Decimal('122791.77')),
 ('07-2017', 'Retail', Decimal('155781.05')),
 ('07-2017', 'Telecommunications', Decimal('28093.85')),
 ('07-2017', None, Decimal('335246.99')),
 ('08-2017', 'Argiculture', Decimal('49846.76')),
 ('08-2017', 'Entertainment', Decimal('72212.21')),
 ('08-2017', 'Financial Services', Decimal('395829.28')),
 ('08-2017', 'Health', Decimal('295134.62')),
 ('08-2017', 'IT', Decimal('110139.30')),
 ('08-2017', 'Manufacturing', Decimal('386049.51')),
 ('08-2017', 'Property', Decimal('114060.63')),
 ('08-2017', 'Retail', Decimal('170997.58')),
 ('08-2017', 'Telecommunications', Decimal('36146.19')),
 ('08-2017', None, Decimal('303576.27')),
 ('09-2017', 'Argiculture', Decimal('58566.02')),
 ('09-2017', 'Entertainment', Decimal('57820.96')),
 ('09-2017', 'Financial Services', Decimal('317579.38')),
 ('09-2017', 'Health', Decimal('252652.97')),
 ('09-2017', 'IT', Decimal('98124.54')),
 ('09-2017', 'Manufacturing', Decimal('356897.59')),
 ('09-2017', 'Property', Decimal('136483.01')),
 ('09-2017', 'Retail', Decimal('152658.73')),
 ('09-2017', 'Telecommunications', Decimal('33568.34')),
 ('09-2017', None, Decimal('279823.99')),
 ('10-2017', 'Argiculture', Decimal('49244.53')),
 ('10-2017', 'Entertainment', Decimal('69173.55')),
 ('10-2017', 'Financial Services', Decimal('357250.87')),
 ('10-2017', 'Health', Decimal('290146.66')),
 ('10-2017', 'IT', Decimal('104678.40')),
 ('10-2017', 'Manufacturing', Decimal('405813.58')),
 ('10-2017', 'Property', Decimal('135093.88')),
 ('10-2017', 'Retail', Decimal('192790.90')),
 ('10-2017', 'Telecommunications', Decimal('38492.80')),
 ('10-2017', None, Decimal('319970.60')),
 ('11-2017', 'Argiculture', Decimal('42396.96')),
 ('11-2017', 'Entertainment', Decimal('63741.48')),
 ('11-2017', 'Financial Services', Decimal('347072.76')),
 ('11-2017', 'Health', Decimal('312967.08')),
 ('11-2017', 'IT', Decimal('89930.11')),
 ('11-2017', 'Manufacturing', Decimal('373581.25')),
 ('11-2017', 'Property', Decimal('107969.81')),
 ('11-2017', 'Retail', Decimal('158762.55')),
 ('11-2017', 'Telecommunications', Decimal('32295.05')),
 ('11-2017', None, Decimal('292928.27')),
 ('12-2017', 'Argiculture', Decimal('42149.09')),
 ('12-2017', 'Entertainment', Decimal('48773.26')),
 ('12-2017', 'Financial Services', Decimal('389990.04')),
 ('12-2017', 'Health', Decimal('308315.97')),
 ('12-2017', 'IT', Decimal('106109.96')),
 ('12-2017', 'Manufacturing', Decimal('319248.23')),
 ('12-2017', 'Property', Decimal('117263.20')),
 ('12-2017', 'Retail', Decimal('153369.72')),
 ('12-2017', 'Telecommunications', Decimal('25852.57')),
 ('12-2017', None, Decimal('300793.18'))]

#### Task 3

Вывести количество онлайн-заказов для всех брендов в рамках подтвержденных заказов клиентов из сферы IT. — (1 балл)

In [63]:
%%sql

SELECT t.brand, COUNT(*) as order_count
FROM customer c
INNER JOIN transaction t on c.customer_id = t.customer_id
WHERE   t.online_order = 'True'
        and c.job_industry_category = 'IT'
        and t.order_status = 'Approved'
GROUP BY t.brand;

 * postgresql://postgres:***@master_ds_dbs_postgre:5432/hw3
7 rows affected.

[(None, 8),
 ('Trek Bicycles', 82),
 ('WeareA2B', 90),
 ('Solex', 101),
 ('Giant Bicycles', 89),
 ('OHM Cycles', 78),
 ('Norco Bicycles', 92)]

#### Task 4

Найти по всем клиентам сумму всех транзакций (list_price), максимум, минимум и количество транзакций, отсортировав результат по убыванию суммы транзакций и количества клиентов. Выполните двумя способами: используя только group by и используя только оконные функции. Сравните результат. — (2 балла)

In [64]:
%%sql
-- GRPUP BY


SELECT  t.customer_id,
        SUM(t.list_price) as total_sum,
        MAX(t.list_price) as max_price,
        MIN(t.list_price) as min_price,
        COUNT(t.list_price) as count
from transaction t
GROUP BY t.customer_id
ORDER BY total_sum DESC, count DESC
LIMIT 20;  -- ограничил в ноутбуке; в sql скрипте нет;

 * postgresql://postgres:***@master_ds_dbs_postgre:5432/hw3
20 rows affected.

[(2183, Decimal('19071.32'), Decimal('2005.66'), Decimal('230.91'), 14),
 (1129, Decimal('18349.27'), Decimal('1992.93'), Decimal('290.62'), 13),
 (1597, Decimal('18052.68'), Decimal('2091.47'), Decimal('360.4'), 12),
 (941, Decimal('17898.46'), Decimal('2091.47'), Decimal('1057.51'), 10),
 (2788, Decimal('17258.94'), Decimal('2083.94'), Decimal('183.86'), 11),
 (936, Decimal('17160.24'), Decimal('2005.66'), Decimal('183.86'), 12),
 (1887, Decimal('17133.93'), Decimal('2091.47'), Decimal('688.63'), 11),
 (1302, Decimal('17035.83'), Decimal('1977.36'), Decimal('71.16'), 13),
 (1140, Decimal('16199.24'), Decimal('2083.94'), Decimal('183.86'), 13),
 (2309, Decimal('16122.34'), Decimal('2091.47'), Decimal('290.62'), 12),
 (729, Decimal('15826.00'), Decimal('2091.47'), Decimal('586.45'), 10),
 (1103, Decimal('15447.92'), Decimal('1977.36'), Decimal('230.91'), 12),
 (1317, Decimal('15370.81'), Decimal('2091.47'), Decimal('569.56'), 9),
 (2874, Decimal('15091.91'), Decimal('2005.66'), Decimal('544.05'), 11),
 (2762, Decimal('15071.26'), Decimal('1997.68'), Decimal('183.86'), 10),
 (255, Decimal('14949.91'), Decimal('1810.0'), Decimal('441.49'), 12),
 (1672, Decimal('14908.46'), Decimal('1977.36'), Decimal('363.01'), 13),
 (1329, Decimal('14818.12'), Decimal('1793.43'), Decimal('543.39'), 11),
 (322, Decimal('14782.23'), Decimal('2005.66'), Decimal('12.01'), 12),
 (3048, Decimal('14756.09'), Decimal('1890.39'), Decimal('543.39'), 13)]

In [75]:
%%sql
-- window functions only


SELECT DISTINCT t.customer_id,
        SUM(t.list_price) OVER (PARTITION by t.customer_id) as total_sum,
        MAX(t.list_price) OVER (PARTITION by t.customer_id) as max_price,
        MIN(t.list_price) OVER (PARTITION by t.customer_id) as min_price,
        COUNT(t.list_price) OVER (PARTITION by t.customer_id) as count
from transaction t
ORDER BY total_sum DESC, count DESC
LIMIT 20;  -- ограничил в ноутбуке; в sql скрипте нет;
-- Если убрать DISTINCT, то видно, что для каждой оконной функции формируется своя группировка (про сравнение)...

 * postgresql://postgres:***@master_ds_dbs_postgre:5432/hw3
20 rows affected.

[(2183, Decimal('19071.32'), Decimal('2005.66'), Decimal('230.91'), 14),
 (1129, Decimal('18349.27'), Decimal('1992.93'), Decimal('290.62'), 13),
 (1597, Decimal('18052.68'), Decimal('2091.47'), Decimal('360.4'), 12),
 (941, Decimal('17898.46'), Decimal('2091.47'), Decimal('1057.51'), 10),
 (2788, Decimal('17258.94'), Decimal('2083.94'), Decimal('183.86'), 11),
 (936, Decimal('17160.24'), Decimal('2005.66'), Decimal('183.86'), 12),
 (1887, Decimal('17133.93'), Decimal('2091.47'), Decimal('688.63'), 11),
 (1302, Decimal('17035.83'), Decimal('1977.36'), Decimal('71.16'), 13),
 (1140, Decimal('16199.24'), Decimal('2083.94'), Decimal('183.86'), 13),
 (2309, Decimal('16122.34'), Decimal('2091.47'), Decimal('290.62'), 12),
 (729, Decimal('15826.00'), Decimal('2091.47'), Decimal('586.45'), 10),
 (1103, Decimal('15447.92'), Decimal('1977.36'), Decimal('230.91'), 12),
 (1317, Decimal('15370.81'), Decimal('2091.47'), Decimal('569.56'), 9),
 (2874, Decimal('15091.91'), Decimal('2005.66'), Decimal('544.05'), 11),
 (2762, Decimal('15071.26'), Decimal('1997.68'), Decimal('183.86'), 10),
 (255, Decimal('14949.91'), Decimal('1810.0'), Decimal('441.49'), 12),
 (1672, Decimal('14908.46'), Decimal('1977.36'), Decimal('363.01'), 13),
 (1329, Decimal('14818.12'), Decimal('1793.43'), Decimal('543.39'), 11),
 (322, Decimal('14782.23'), Decimal('2005.66'), Decimal('12.01'), 12),
 (3048, Decimal('14756.09'), Decimal('1890.39'), Decimal('543.39'), 13)]

#### Task 5

Найти имена и фамилии клиентов с минимальной/максимальной суммой транзакций за весь период (сумма транзакций не может быть null). Напишите отдельные запросы для минимальной и максимальной суммы. — (2 балла)

In [66]:
%%sql

SELECT c.first_name , c.last_name, SUM(t.list_price) as min_price
FROM transaction t
INNER JOIN customer c ON c.customer_id = t.customer_id
GROUP BY c.customer_id
ORDER BY min_price
limit 1;

 * postgresql://postgres:***@master_ds_dbs_postgre:5432/hw3
1 rows affected.

[('Hamlen', 'Slograve', Decimal('60.34'))]

In [67]:
%%sql

SELECT c.first_name , c.last_name, SUM(t.list_price) as max_price
FROM transaction t
INNER JOIN customer c ON c.customer_id = t.customer_id
GROUP BY c.customer_id
ORDER BY max_price DESC
limit 1;

 * postgresql://postgres:***@master_ds_dbs_postgre:5432/hw3
1 rows affected.

[('Jillie', 'Fyndon', Decimal('19071.32'))]

#### Task 6

Вывести только самые первые транзакции клиентов. Решить с помощью оконных функций. — (1 балл)

In [73]:
%%sql

SELECT DISTINCT
        FIRST_VALUE(customer_id) OVER (PARTITION BY customer_id ORDER BY transaction_date) as customer_id,
        FIRST_VALUE(transaction_id) OVER (PARTITION BY customer_id ORDER BY transaction_date) as transaction_id,
        FIRST_VALUE(transaction_date) OVER (PARTITION BY customer_id ORDER BY transaction_date) as transaction_date
FROM transaction
LIMIT 20;  -- ограничил в ноутбуке; в sql скрипте нет;

 * postgresql://postgres:***@master_ds_dbs_postgre:5432/hw3
20 rows affected.

[(1877, 4091, datetime.date(2017, 1, 18)),
 (2958, 15781, datetime.date(2017, 1, 21)),
 (2507, 5011, datetime.date(2017, 1, 22)),
 (3140, 19134, datetime.date(2017, 1, 25)),
 (2051, 10597, datetime.date(2017, 1, 12)),
 (98, 16329, datetime.date(2017, 4, 21)),
 (1727, 4046, datetime.date(2017, 2, 6)),
 (3414, 2818, datetime.date(2017, 1, 3)),
 (1699, 15115, datetime.date(2017, 1, 10)),
 (54, 11374, datetime.date(2017, 2, 25)),
 (938, 13338, datetime.date(2017, 1, 6)),
 (2214, 4414, datetime.date(2017, 1, 8)),
 (609, 6370, datetime.date(2017, 3, 14)),
 (3118, 9357, datetime.date(2017, 6, 24)),
 (1641, 6026, datetime.date(2017, 1, 19)),
 (340, 8209, datetime.date(2017, 1, 2)),
 (3495, 18035, datetime.date(2017, 1, 13)),
 (2563, 16778, datetime.date(2017, 2, 24)),
 (2463, 1870, datetime.date(2017, 4, 27)),
 (289, 17947, datetime.date(2017, 2, 21))]

#### Task 7

Вывести имена, фамилии и профессии клиентов, между транзакциями которых был максимальный интервал (интервал вычисляется в днях) — (2 балла).

In [72]:
%%sql

WITH lag_prev_transaction AS (
    SELECT
        customer_id,
        transaction_date,
        LAG(transaction_date) OVER (PARTITION BY customer_id ORDER BY transaction_date) AS prev_transaction_date
    FROM transaction
),
interval_transaction AS (
    SELECT
        customer_id, 
        transaction_date - prev_transaction_date AS interval
    FROM lag_prev_transaction
    WHERE prev_transaction_date IS NOT NULL
),
max_interval_customer AS (
    SELECT
        customer_id, 
        MAX(interval) AS max_interval
    FROM interval_transaction
    GROUP BY customer_id
)
SELECT
    c.first_name,
    c.last_name,
    c.job_title,
    m.max_interval
FROM customer c
INNER JOIN max_interval_customer m ON c.customer_id = m.customer_id
ORDER BY m.max_interval DESC
LIMIT 20;  -- ограничил в ноутбуке; в sql скрипте нет;

 * postgresql://postgres:***@master_ds_dbs_postgre:5432/hw3
20 rows affected.

[('Susanetta', None, 'Legal Assistant', 357),
 ('Gregorius', 'Cockram', 'Data Coordiator', 330),
 ('Stoddard', 'Giacomoni', 'Structural Analysis Engineer', 330),
 ('Royall', 'Terris', 'Geological Engineer', 330),
 ('Bearnard', 'Letixier', None, 329),
 ('Caralie', 'Sellors', 'Senior Editor', 321),
 ('Debee', 'Martynov', 'Senior Editor', 320),
 ('Genni', 'Larway', 'Environmental Specialist', 314),
 ('Franz', 'Craddy', None, 310),
 ('Timmie', 'Lenden', None, 310),
 ('Carolynn', 'Samsin', 'Pharmacist', 310),
 ('Jodee', 'Judkins', 'Recruiting Manager', 306),
 ('Ashia', 'Muzzi', 'Mechanical Systems Engineer', 306),
 ('Heywood', 'Sollett', 'Tax Accountant', 305),
 ('Cleveland', 'Islep', 'Software Engineer II', 299),
 ('Sheilah', 'Blackmore', None, 297),
 ('Jazmin', 'Neumann', 'VP Quality Control', 297),
 ('Michel', "O'Halligan", 'Software Test Engineer IV', 297),
 ('Jesus', 'MacShirie', None, 296),
 ('Donny', 'Stiven', 'Computer Systems Analyst II', 292)]